import React, { Fragment } from 'react';
import './style.modules.scss'
// import './style.modules.media.scss'
import { useTranslation } from 'react-i18next';
import CommonHeader from '../../themes/common/Header/CommonHeader';
const text = [
    {
        title: 'ЗАГАЛЬНІ ПОЛОЖЕННЯ',
        subtitles: [
            `1.1. ТОВ «?????????», (далі Виконавець та/або Компанія) публікує цей Публічний договір (Угода та/або Оферта) про надання послуг на інтернет-сайті Виконавця http://firm-ua.com та додатках FIRM-UA.com для мобільних пристроїв на базі операційних систем iOS, Android, Windows mobile/Windows Phone.            `,
            `1.2. Відповідно до статті 633 Цивільного Кодексу України (ЦК України) ця Угода є публічним договором, і в разі прийняття (акцепту) викладених нижче умов будь-яка дієздатна фізична або юридична особа (далі Користувач) зобов'язується виконувати умови цієї Угоди.`,
            `1.3. У цій оферті, якщо зміст не вимагає іншого, наведені нижче терміни вживаються у такому значенні:         `,
            `Оферта - публічна пропозиція Виконавця, адресована будь-якій дієздатній фізичній та/або юридичній особі, укласти з ним Публічний договір про надання послуг на умовах, що містяться в цій Угоді, зважаючи на всі додатки; `,
            `Акцепт - повне прийняття Користувачем умов Угоди;`,
            `Виконавець - ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «?????????», юридична адреса: ????????????;`,
            `Сайт/и - інтернет-сайт http://firm-ua.com, додатки FIRM-UA.com для мобільних пристроїв на базі операційних систем iOS, Android, Windows mobile/Windows Phone, які адмініструються Компанією і представляють собою комунікаційну платформу для розміщення тимчасових класифікованих оголошень (далі по тексту - Сайт та/або Сайти);`,
            `Користувач - будь-яка дієздатна фізична або юридична особа, яка прийняла умови цієї Угоди та користується послугами Компанії. Від імені юридичної особи користування Сайтом здійснюється уповноваженим співробітником / представником такої юридичної особи. Умови використання корпоративних облікових записів викладені у Додатку 2 до цієї Угоди;           `,
            `Бізнес-користувач - Користувач, що використовує Сайт у бізнес-цілях, та відповідає хоча б одній із зазначених у даній Угоді ознак. Користувач може вважатися Компанією Бізнес-користувачем незалежно від того, чи зареєстрований такий Користувач як суб’єкт підприємницької діяльності у встановленому законодавством порядку, чи здійснює таку діяльність без відповідної реєстрації;`,
            `Товар - будь-який матеріальний і нематеріальний об'єкт;            `,
            `Послуга - будь-яка операція, що не є постачанням товарів, пов'язана з наданням сервісу, який споживається в процесі вчинення певної дії або здійснення певної діяльності, для задоволення особистих потреб замовника;`,
            `Послуги/сервіс FIRM-UA.com - будь-які платні та безкоштовні сервіси, що надаються Виконавцем за допомогою Сайтів (наприклад, в тому числі, але не виключно, всіх його можливостей, тексту, даних, інформації, програмного забезпечення, графіків або фотографій, малюнків і т. д. і т.п.), та будь-яких інших послуг, що надаються Компанією за допомогою сервісів Сайтів.`,
            `Обліковий запис/аккаунт - електронний кабінет Користувача в функціональній системі Сайтів, що створюється Користувачем та належить Виконавцю, за допомогою якого Користувач може керувати своїми оголошеннями на Сайтах. Обліковим записом / аккаунтом може користуватися тільки один Користувач, передача даних для доступу до свого облікового запису / аккаунту іншому користувачеві (іншій особі) не допускається;            `,
            `Реєстрація - прийняття Користувачем оферти на укладання цієї Угоди і процедура, в ході якої Користувач за допомогою заповнення відповідних форм Сайту надає необхідну інформацію для використання сервісів Сайту. Реєстрація вважається завершеною тільки в разі успішного проходження всіх її етапів відповідно до опублікованих на Сайті інструкцій.`,
            `Персональні дані - це відомості чи сукупність відомостей про фізичну особу, яка за їх допомогою ідентифікована або може бути конкретно ідентифікована.`,
            `SMS-верифікація - це перевірка Користувача, яка здійснюється шляхом введення у відповідне поле на сторінці верифікації спеціального коду верифікації, надісланого Компанією в SMS-повідомленні на номер, вказаний Користувачем на сторінці верифікації.`,
            `Розміщення - це дія Користувача - публікація, або активація одного оголошення. Розміщенням також є зміна існуючого оголошення, якщо така зміна передбачає зміну, і / або додавання товару, зміна істотних характеристик товару, зміна регіону.`,
            `1.4. Якщо Користувач не згоден з цією Угодою повністю або частково, Виконавець просить його залишити цей сайт, та/або видалити додаток з пристрою. Ці умови регулюють використання Користувачем Сайтів та послуг FIRM-UA.com. Використання послуг сайту FIRM-UA.com означає, що Користувач ознайомлений з цією Угодою, розуміє і приймає її умови. Права та обов’язки Сторін, правила користування Сайтами можуть міститись також у статтях Центру підтримки користувачів, матеріалах, розміщених на Сайті (або посилання на які розміщені на Сайті). Такі статті, матеріали являються невід’ємною частиною Угоди.`,
            `1.5. Починаючи використовувати будь-який сервіс FIRM-UA.com, встановлюючи додаток, або пройшовши процедуру реєстрації, Користувач підтверджує свою дієздатність та прийняття умов Угоди в повному обсязі, без будь-яких застережень і винятків. У разі незгоди Користувача з будь-яким з положень цієї Угоди, Користувач не має права використовувати сервіси FIRM-UA.com.`,
            `1.6. Цим Компанія пропонує Користувачам мережі Інтернет використовувати свої сервіси на умовах, викладених в цій Угоді.`,
            `1.7. Компанія пропонує Користувачеві послуги з використання Сайтів для розміщення інформації про товари (послуги) з метою, в тому числі, але не виключно, подальшої купівлі або продажу різних товарів та послуг іншими Користувачами.`,
            `1.8. Всі угоди укладаються між Користувачами безпосередньо. Таким чином, Компанія не є учасником угод Користувачів, а лише надає комунікаційну торговельну платформу для розміщення оголошень.`,
            
        ]
    },
    {
        title: `РОЗМІЩЕННЯ ОГОЛОШЕНЬ`,
        subtitles: [
            `2.1. Користувач отримує право розміщувати оголошення на Веб-сайтах після проходження SMS-верифікації.
            У разі видалення Користувачем облікового запису, телефонний номер, який раніше використовувався для SMS-верифікації, може бути використаний Користувачем повторно не раніше 30 днів з дати видалення облікового запису. У разі блокування Компанією немає облікового запису, телефонний номер, який використовувався для SMS-верифікації, може бути використаний повторно не раніше 1 року з дати блокування відповідного облікового запису.`,
            `2.2. Користувач також має право зареєструватися на Сайтах з метою отримання додаткових сервісів, заповнивши формуляр із зазначенням дійсної електронної адреси, до якої має доступ тільки користувач, номера мобільного телефону, а також інших даних, необхідних для реєстрації. Після цього Користувач отримує електронний лист з підтвердженням реєстрації, що містить посилання, перехід за яким необхідний для завершення реєстрації, або SMS повідомлення із паролем для входу до облікового запису (аккаунта)`,
            `2.3. Користувач має право створити обліковий запис і увійти на Сайт, використовуючи дані облікового запису в Facebook через підключення Facebook Connect. Користувач, який не зареєстрований на Сайті, для реєстрації за допомогою Facebook, повинен ввести дані свого облікового запису (логін і пароль) Facebook за запитом системи, після чого зможе скористатися сервісами Сайту. Реєструючись на Сайті через через підключення Facebook Connect, Користувач надає Компанії додаткові персональні дані. Детальна інформація про персональні дані, які надаються Компанії і обробляються Компанією - в Додатку №1 до Угоди.`,
            `2.4. Використання можливостей і сервісів Сайтів, як зареєстрованими так і незареєстрованими Користувачами означає прийняття зобов'язань дотримуватися правил та інструкцій щодо користування послугами FIRM-UA.com, в тому числі цієї Угоди.`,
            `2.5. Користувач несе відповідальність за всі дії з використанням його електронної адреси, номера мобільного телефону та пароля для входу на Сайти. Користувач має право користуватися сервісами Сайтів тільки за допомогою власної електронної адреси, мобільного телефону та пароля. У разі передачі даних для доступу до облікового запису/аккаунта іншому користувачеві (іншій особі), такий обліковий запис/акаунт може бути заблокований на розсуд Адміністрації.`,
            `2.6. Користувач зобов'язується зберігати конфіденційність пароля і не розкривати/передавати його третім особам.`,
            `2.7. Користувач зобов'язаний негайно змінити дані для входу на Сайти, якщо у нього є причини підозрювати, що його електронну адресу, телефон та пароль, які використовуються для входу на Сайти, були розкриті, або можуть бути використані третіми особами.`,
            `2.8. Користувач, який розміщує оголошення про продаж товарів або послуг на Сайті, зобов'язується розмістити інформацію про них відповідно до цієї Угоди та інструкцій, представлених на Сайті та надати точну і повну інформацію про товари або послуги та умови їх продажу. Розміщуючи інформацію про товар або послугу, Користувач підтверджує, що він має право продавати цей товар або надавати цю послугу відповідно до вимог законодавства країн, в яких вони реалізуються.`,
            `2.9. Користувач гарантує, що запропоновані ним товари/послуги відповідають нормам якості, які встановлені законодавством країн, для яких вони реалізуються і вільні від претензій третіх осіб.`,
            `2.10. Користувач гарантує, що запропоновані ним послуги, у разі, якщо їх надання вимагає спеціального дозволу, будуть надані відповідно до вимог законодавства країн, спеціальні органи яких будуть уповноважені здійснювати нагляд за такою діяльністю Користувача.`,
            `2.11. Користувач зобов'язаний ретельно перевірити всю інформацію про товари і послуги, що розміщені ним на Сайтах та у разі виявлення невірної інформації, додати необхідні відомості в опис товару або послуги. Якщо виправити невірну інформацію неможливо, анулюйте оголошення та повторно розмістіть інформацію про товар або послугу.`,
            `2.12. Умови доставки повинні включатися в опис товару, а умови надання послуг в опис послуги. Умови продажу товару та надання послуг, складені Користувачем, не повинні суперечити цій Угоді та чинному законодавству країн, для яких вони реалізуються.`,
            `2.13. Користувач зобов'язується не надавати активну підтримку і не поширювати інформацію про послуги, що надаються конкурентами Виконавця, у тому числі, але не виключно:  `,
            `• Інформацію про інші дошки оголошень, торгові майданчики, інтернет-аукціони та/або інтернет-магазини;`,
            `• Інтернет-ресурсах, що пропонують товари та послуги, заборонені до продажу на Сайтах.`,
          
            `2.14. Компанія має право перемістити, завершити або продовжити термін демонстрації товару або послуги Користувача з технічних причин, що знаходяться під контролем або поза контролем Компанії. Компанія має право припинити демонстрацію оголошення, якщо Користувач зареєстрував товар або послугу, з порушенням умов цієї Угоди або чинного законодавства.`,
            `2.15. Користувачу заборонено:`,
            `2.15.1. Публікувати однакові оголошення з однієї адреси електронної пошти / номера мобільного телефону;`,
            `2.15.2. Публікувати схожі за змістом оголошення, де очевидно, що мова йде про ту саму пропозицію;`,
            `2.15.3. Дублювати однакові оголошення з різних адрес електронної пошти / номерів мобільних телефонів;`,
            `2.15.4. Публікувати оголошення в рубриці, яка не відповідає змісту оголошення;            `,
            `2.15.5. Публікувати оголошення, в заголовку яких містяться повторювані знаки пунктуації та/або не літерні символи;            `,
            `2.15.6. Публікувати оголошення, опис і/або заголовок/фотографії яких є непов'язаними, не розбірливими;            `,
            `2.15.7. Публікувати оголошення з пропозицією кількох товарів і послуг одночасно;            `,
            `2.15.8. Вставляти в оголошенні посилання на ресурси, які містять шкідливі елементи або посилання на головну сторінку сайту;            `,
            `2.15.9. Розміщувати оголошення про товар або послугу, якщо таке розміщення може призвести до порушення застосовного законодавства;`,
            `2.15.10. Оголошення повинні відповідати географічній області та місту, обраним у відповідних функціональних налаштуваннях Сайтів.            `,
            `2.15.11. Дозволяється розмістити одне оголошення щодо одного конкретного предмета, об'єкта майна, вакансії, послуги.            `,
            `2.15.12. Оголошення можуть проходити вибіркову перевірку (модерацію) представниками Компанії, як перед, так і після розміщення.            `,
            `2.16. Адміністрація та модератори Сайту (представники Компанії) мають право:            `,
            `2.16.1. Вносити в текст оголошення Користувача виправлення, що стосуються орфографії і пунктуації, які не впливають на загальний зміст оголошення;            `,
            `2.16.2. Переносити оголошення в інші рубрики Сайту у разі виявлення більш придатної рубрики для їх розміщення;            `,
            `2.16.3. Відмовити в публікації оголошень, якщо вони не відповідають тематиці вибраних розділів, або порушують цю Угоду, та обмежувати кількість оголошень від одного Користувача з метою зручності користування Сайтом без пояснення причин;            `,
            `2.16.4. Не допускається використання некоректних характеристик предмета пропозиції в оголошенні. У тому числі використання цін, що не відповідають фактичній ціні реалізації товару або послуги. Ціна повинна бути вказана повністю за весь товар або послугу;            `,
            `2.16.5. Заголовок оголошення повинен відповідати тексту самого оголошення і не повинен містити контактну або персональну інформацію про Користувача (телефон, електронні адреси, адресу інтернет-ресурсу тощо);            `,
            `2.16.6. Фото, яке демонструє товар/послугу, пропоновані Користувачем до продажу, мають відповідати заголовку та тексту оголошення. На фото має бути зображений лише пропонований об'єкт. Стокові фото та/або фото, завантажені з мережі Інтернет, заборонені до публікації в оголошеннях приватних Користувачів.             `,
            `2.16.7. Щоб полегшити взаємодію між Користувачами, Компанія може встановлювати обмежений доступ до контактної інформації інших Користувачів. Право використання відомостей, наданих іншими Користувачами, обмежується цією Угодою.            `,
            `2.16.8. Компанія не несе відповідальності за зміст оголошень або гіперпосилань на ресурси, зазначені в описі повідомлень користувачів;            `,
            `2.16.9. Предметом оголошень можуть бути товари або послуги, реалізація яких не заборонена та не обмежена відповідно до законодавства країни, в яких вони реалізуються, та не суперечить цій Угоді.            `,
            `2.17. Для обліку кількості розміщених оголошень за одиницю приймається 1 (одне) Розміщення.            `,
            
        ]
    },
    {
        title: `УМОВИ ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ КОРИСТУВАЧІВ ТА ЗГОДА НА ОБРОБКУ`,
        subtitles: [
            `3.1. У разі розміщенні оголошень користувачі Сайту надають Компанії право на обробку їх персональних даних на умовах, передбачених в Додатку №1 (ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ) до цієї Угоди.`,
            
        ]
    },
    {
        title: `ВІДОМОСТІ, ЩО НАДАЮТЬСЯ КОРИСТУВАЧЕМ`,
        subtitles: [
            `4.1. Компанія зберігає за собою право зв'язуватися з Користувачем: направляти інформаційні повідомлення на електронну та фізичну адресу, вказану при реєстрації, та відправляти повідомлення на мобільний телефон Користувача.            `,
            `4.2. Збір інформації здійснюється шляхом самостійного, з використанням програмних засобів Сайту, зазначення Користувачем відповідних даних, необхідних для розміщення оголошень на ньому.            `,
            `4.3. Інформація технічного характеру, що міститься в системі, наприклад, ip-адреса, відповідно до загальних правил інтернет-повідомлень, використовується Компанією з метою, пов'язаною з обслуговуванням мережевого обладнання, та для агрегації загальної статистичної, демографічної інформації (наприклад, про регіон, з якого було здійснено з'єднання Користувачем).            `,
            `4.4. Компанія зберігає дані останнього доступу Користувача до системи, з метою забезпечення високої якості сервісів, що пристосовуються до індивідуальних потреб та інтересів Користувача.            `,
            `4.5. Користувач здійснює доступ до сервісів Сайту протягом часових проміжків безперервного використання - сесій. Зареєстрований Користувач здійснює доступ до частини Сайту, яка доступна виключно після введення їм логіну та пароля, хоч би один раз, протягом сесії.            `,
            `4.6. Відключення збереження даних щодо останнього доступу в систему в налаштуваннях браузера не впливає на можливість використання сервісів Сайту в цілому, однак може обмежити їх функціонал для Користувача.            `,
            `4.7. Дані останнього доступу в систему також використовуються для збирання статистичної інформації про використання послуг Користувачами.            `,
            `4.8. Користувачеві забороняється надавати інформацію з порушенням умов цієї Угоди або прав третіх осіб, зокрема, інформація не повинна містити:            `,
            `• вульгарних, образливих виразів;`,
            `• пропаганду ненависті, насилля, дискримінації, расизму, ксенофобії, міжнаціональних конфліктів;            `,
            `• заклики до насильства і протиправних дій;            `,
            `• дані, що порушують особисті (немайнові) права, або права інтелектуальної власності третіх осіб;            `,
            `• інформацію, що сприяє шахрайству, обману або зловживання довірою;            `,
            `• інформацію, яка призводить до здійснення операцій з краденими чи підробленими предметами;            `,
            `• інформацію, яка порушує чи посягає на власність третіх осіб, комерційну таємницю або право на недоторканість приватного життя;            `,
            `• особисту чи ідентифікуючу інформацію про інших осіб без їх ясно висловленої згоди;            `,
            `• інформацію, що містить відомості, які посягають на недоторканність приватного життя, що ображає чиюсь честь, гідність чи ділову репутацію;            `,
            `• інформацію, що містить наклеп або погрози на адресу будь кого;            `,
            `• інформацію, що носить характер порнографії;            `,
            `• інформацію, що завдає шкоди неповнолітнім;            `,
            `• хибну і неправдиву інформацію, інформацію, яка вводить в оману;            `,
            `• віруси або будь-які інші технології, що можуть завдати шкоди Сайту, Компанії, або іншим користувачам;            `,
            `• інформацію про сервіси, що вважаються аморальними, таких як: проституція, або інші форми, що суперечать нормам моралі або закону;            `,
            `• посилання або інформацію про сайти, що конкурують з сервісами Компанії;            `,
            `• інформацію, що представляє собою «спам», «листи щастя», «схеми пірамід» або небажану або брехливу комерційну рекламу;            `,
            `• інформацію, поширювану інформаційними агентствами;            `,
            `• інформацію з пропозицією заробітку в інтернеті, без вказівки фізичної адреси і прямих контактів роботодавця;            `,
            `• інформацію з пропозицією франшизи, багаторівневого та мережевого маркетингу, агентської діяльності, торгового представництва або будь-якої іншої діяльності, яка вимагає вербування (залучення) інших членів, суб-агентів, суб-дистриб’юторів та інше;            `,
            `• відомості виключно рекламного характеру без пропозиції конкретного товару або послуги;            `,
            `• інформацію, що іншим чином порушує законодавство країни, для якої призначене оголошення.            `,
            `4.9. У разі подачі оголошення з пропозиціями послуг, що підлягають ліцензуванню, в тексті оголошення потрібно вказувати номер ліцензії та найменування органу, який видав ліцензію.            `,
            
        ]
    },
    {
        title: `ПРИЧИНИ ВИДАЛЕННЯ ОГОЛОШЕНЬ `,
        subtitles: [
            `5.1. Оголошення Користувача може бути видалено Компанією через порушення Користувачем умов цієї Угоди, та з таких причин:`,
            ` • У Користувача вже є на Сайті активне аналогічне оголошення з рекламою цього товару/послуги;            `,
            ` • Інформація, що міститься в оголошенні, суперечить цій Угоді, Правилам публікації оголошень та/або законодавству;            `,
            ` • Інформація, що міститься в оголошенні є неправдивою;            `,
            ` • Заголовок оголошення не містить інформацію про запропонований/запитаний товар/послугу;            `,
            ` • Заголовок оголошення містить повторювані знаки оклику та питання, крапки та інші знаки;            `,
            ` • Тема або коментар до фотографії містять посилання на Інтернет-ресурси;            `,
            ` • Фотографія не має очевидного смислового зв'язку з текстом оголошення або не має на меті адекватно проілюструвати текст оголошення;            `,
            ` • Фотографія містить елементи призначеного для користувача інтерфейсу, абстрактні малюнки і т. п.;            `,
            ` • Фотографія містить будь-яку рекламну інформацію (посилання на сайт, e-mail, номер телефону, Skype, IСQ, ID в соцмережах, ID інших месенджерів і подібне);            `,
            ` • Фотографія поганої якості, зображуваний предмет невиразний;            `,
            ` • Оголошення надано у рубрику, яка не відповідає змісту оголошення;            `,
            ` • Компанії надано скаргу від власника майнових прав інтелектуальної власності, та/або запит уповноваженого органу державної влади;            `,
            ` • Компанії надано обґрунтована скарга іншого Користувача про порушення його прав в оголошенні.            `,
            
        ]
    },
    {
        title: ` ПРАВА ТА ОБОВ'ЯЗКИ СТОРІН `,
        subtitles: [
            `6.1. Всі об'єкти, доступні за допомогою сервісів Компанії, у тому числі елементи дизайну, текст, графічні зображення, ілюстрації, відео, комп’ютерні програми, бази даних, музика, звуки і інші об'єкти, а також будь-який контент, розміщений на сервісах Сайту, є об'єктами виключних прав Компанії, Користувачів та інших правовласників.            `,
            `6.2. Використання контенту, та будь-яких інших елементів сервісів можливо тільки в рамках функціоналу, пропонованого тим чи іншим сервісом Сайту. Ніякі елементи змісту сервісів Сайту, а також будь-який контент, розміщений на сервісах Сайту, не можуть бути використані іншим чином без попереднього дозволу правовласника. Під використанням мається на увазі, в тому числі, але не виключно: відтворення, копіювання, переробка, поширення на будь-якій основі і т.д.            `,
            `6.3. Щоб надати Компанії право публікувати відомості, надані Користувачем, Користувач надає Компанії чинне повсюдно (територіально необмежене), безстрокове, безвідкличне, невиключне, суб- ліцензоване право на використання, публікацію, збір, демонстрацію, копіювання, дублювання, відтворення, доведення до загального відома щодо об’єктів авторських прав, публікацій та баз даних, якими володіє Користувач, а також щодо наданих їм відомостей, зображень і фотографій на всіх відомих або невідомих інформаційних носіях. Перераховані вище права надаються Компанії безоплатно (без виплати винагороди). При цьому Користувач зберігає всі майнові права на зміст інформації, що розміщується в оголошенні. Крім переліченого, Користувач надає право на доступ до розміщеної ним інформації всім користувачам Сайтів. Користувач погоджується з тим, що текст оголошень, фотографії, і інші матеріали, додані до оголошення, можуть бути використані Компанією при підготовці рекламних матеріалів, статей, звітів, аналізів і т.д., і використовуватися Компанією на власний розсуд без додаткової згоди з боку Користувача, без виплати винагороди.            `,
            `6.4. Скориставшись сервісами Сайтів, Користувач підтверджує, що несе особисту відповідальність за зміст розміщених ним оголошень, а також володіє всіма необхідними правами, ліцензіями, дозволами на розміщення інформації в оголошенні на Сайтах, включаючи без обмежень всі патенти, торгові марки, комерційні таємниці, авторські права, або ж має відповідну письмову згоду, ліцензію або дозвіл всіх ідентифікованих в оголошенні осіб і компаній для використання їх імен, торгових марок, або зображень, якщо це необхідно відповідно до застосовного законодавства.`,
            `6.5. Користувач зобов'язується:            `,
            ` • Не вчиняти дій, які можуть призвести до непропорційно великого навантаження на інфраструктуру Сайтів;            `,
            ` • Не використовувати автоматичні програми для отримання доступу до Сайтів без письмового дозволу Компанії;            `,
            ` • Не копіювати, не відтворювати, не змінювати, не поширювати і не представляти громадськості будь-яку інформацію, що міститься на Сайтах (крім відомостей, наданих самим Користувачем) без попереднього письмового дозволу Компанії;            `,
            ` • Не перешкоджати і не намагатися перешкоджати роботі та іншій діяльності на Сайтах; а також не перешкоджати дії автоматичних систем або процесів, а також інших заходів, з метою перешкодити або обмежити доступ на Сайти;            `,
            ` • Не використовувати відомості, надані іншими Користувачами, в інших цілях, окрім як для здійснення угоди безпосередньо з цим Користувачем, без письмового дозволу іншого Користувача. В цей пункт Угоди не включені персональні дані Користувача, які останній надає Компанії при реєстрації.            `,
            `6.6. Користувачу забороняється:            `,
            ` • Обговорення дій модераторів і адміністрації Сайту іншим чином, окрім як за допомогою електронного листування з модераторами;            `,
            ` • Використання імен Користувачів, схожих на імена інших Користувачів, з метою видати за них себе і писати повідомлення від їх імені.            `,
            `6.7. Доступ до персональних даних Користувача з боку інших Користувачів можливий тільки при наявності письмової згоди Користувача на подібний доступ або на виконання вимог відповідного законодавства.            `,
            `6.8. Компанія зобов'язується докладати всіх зусиль для належного виконання своїх обов'язків за цією Угодою, включаючи нормальну роботу сервісів Сайтів і нерозповсюдження третім особам персональних даних, наданих Користувачем, за винятком випадків, передбачених законодавством.            `,
            `6.9. Компанія може періодично встановлювати обмеження щодо використання сервісів Сайтів, зокрема, максимальна кількість днів зберігання оголошень і їх розмір. Компанія має право в будь-який момент змінити або припинити роботу сервісів Сайтів або їх частини з повідомленням Користувача, або без нього, не несучи при цьому відповідальності за подібні зміни або припинення.            `,
            `6.10. Щоб підтримувати високу якість своїх послуг, Компанія залишає за собою право обмежити кількість активних оголошень Користувача на Сайтах, а також обмежити дії Користувача на Сайтах.            `,
            `6.11. Компанія може заборонити Користувачеві доступ на Сайти, якщо Користувач порушує умови цієї Угоди. Факт порушення вважається підтвердженим, якщо Користувач був сповіщений адміністрацією Сайтів про ведення діяльності, яка порушує правила Сайтів, або прав третіх осіб. Компанія залишає за собою право в будь-який момент видалити або відключити обліковий запис Користувача, а також видалити всі розміщені оголошення Користувача, залишивши попереднє повідомлення Користувача про таке відключення на свій розсуд, і не несучи при цьому відповідальність за свої дії перед Користувачем і третіми особами.            `,
            `6.12. Компанія має право на власний розсуд не приймати, видаляти або переміщувати будь-яке розміщене на Сайтах оголошення за порушення цієї Угоди.            `,
            `6.13. Компанія має право передати Сайти зі всіма його сервісами та змістом, включаючи персональні дані Користувачів, своєму правонаступнику, за договорами або на інших підставах. Передача і повідомлення Користувачів про таку передачу здійснюється відповідно до вимог чинного законодавства України.            `,
            `6.14. Користувач має право направляти скарги з питань роботи Сайту через форму зворотного зв'язку які будуть розглянуті протягом двох робочих днів з моменту їх надходження чи з моменту отримання повної інформації по суті скарги. Компанія має право на свій розсуд припинити розгляд скарги, та/або обмежити кількість відповідей Користувачам, якими порушено умови Угоди.            `,
            `6.15. Компанія залишає за собою право в будь-який момент вимагати від Користувача підтвердження даних, вказаних ним при реєстрації і запитати в зв'язку з цим підтверджуючі документи (зокрема - копії/завірені копії документів, що засвідчують особу), ненадання яких, на розсуд Користувача, може бути прирівняне до надання недостовірної інформації. У разі якщо дані Користувача, зазначені в наданих їм документах, не відповідають даним, зазначеним при реєстрації, а також у випадку, коли дані, вказані при реєстрації, не дозволяють ідентифікувати Користувача, Компанія має право відмовити Користувачеві в доступі до використання сервісів Сайтів з попереднім повідомленням Користувача або без повідомлення.            `,
            `6.16. SMS-верифікація. Компанія має право в будь-який момент верифікувати Користувача засобами SMS-верифікації. У разі якщо Користувач не пройшов верифікацію, Компанія має право обмежити можливості користування Сайтом, а саме розміщення, редагування, продовження, оновлення оголошень. Вибірка користувачів, які підлягають верифікації, здійснюється Компанією на свій власний розсуд. Всі Користувачі, які були верифіковані за допомогою SMS-верифікації можуть використовувати номер мобільного телефону для входу до облікового запису/акаунта, використовуючи пароль, зазначений при реєстрації.            `,
            `Компанія має право на свій розсуд не допускати верифікацію Користувачів, що використовують номери телефонів певних операторів стільникового зв'язку (в тому числі віртуальних), CDMA-операторів.            `,
            `6.17. Компанія на підставі аналізу діяльності Користувача на Сайті має право відносити Користувача до категорії «Бізнес-користувач», не залежно від того, чи Користувач відніс себе до даної категорії при публікації оголошення. Для віднесення Користувача до категорії «Бізнес» достатньо наявності в діях Користувача однієї з таких ознак:            `,
            ` • використання при розміщенні оголошення професійних фотографій (стокових фотографій);            `,
            ` • наявність в тексті оголошення посилання на веб-сайт/сторінку веб-сайту;            `,
            ` • наявність в тексті оголошення інформації про можливість вибору іншої моделі, наявності товару в асортименті, різних розмірів товару, можливості замовлення товару, надання Користувачем гарантії на товар;            `,
            ` • придбання Користувачем будь-якого пакету розміщень.            `,
            `Компанія відносить Користувача до категорії Бізнес-користувач для тих рубрик / підрубрик, в яких Користувач здійснив дії, передбачені цим пунктом Угоди, для всіх інших рубрик / підрубрик Користувач не набуває статусу Бізнес-користувач.            `,
            `6.18. Компанія має право в будь-який момент припинити підтримку (функціонування) певних версій додатку FIRM-UA.com для мобільних пристроїв на базі будь-яких операційних систем. Для продовження використання додатку, Користувачеві необхідно оновити додаток до нової версії, або ж завантажити додаток у актуальній версії.            `,
            
        ]
    },
    {
        title: `ОПЛАТА ПОСЛУГ`,
        subtitles: [
            `7.1. Замовлення (акцептування) платних послуг FIRM-UA.com здійснюється Користувачем на відповідній сторінці замовлення послуги, або через відповідний розділ мобільних додатків, в особистому обліковому записі, а також в будь-яких інших відповідних розділах Сайту.           `,
            `7.2. Користувач зобов'язується ознайомитися з цінами на платні послуги Компанії. Вартість обраної послуги доступна на сторінці замовлення і залежить від параметрів замовлення.            `,
            `7.3. Оплата платних послуг Компанії здійснюється в порядку, зазначеному за адресою             `,
            `7.4. Повернення сплачених грошових коштів за не надані послуги здійснюється Компанією в наступних випадках:            `,
            ` • Автоматично функціональною системою Сайтів за кожне видалене оголошення при модерації (крім не актуальних оголошень), якщо для оголошення придбані платні послуги (Набори послуг для просування оголошень, Топ-оголошення, VIP-оголошення, Підняти вгору списку (за виключенням одноразового підняття), Лого в списку оголошень на 30 днів). Повернення грошових коштів здійснюється за ті години, в які послуга не надавалася. Для здійснення розрахунку суми коштів, що підлягають поверненню, приймаються астрономічні години, повернення відбувається за ті години, коли послуга фактично не надавалася.            `,
            ` • Якщо через будь-які технічні неполадки послуга не надавалася, повернення сплачених грошових коштів здійснюється уповноваженим Компанією адміністратором Сайту/ів після надання Користувачем доказів оплати. В такому випадку повернення грошових коштів відображається в аккаунті Користувача з можливістю використання сплачених грошових коштів в майбутньому.            `,
            ` • У разі оплати послуг з видалених Компанією облікових записів, які були дубльовані Користувачем в порушення умов цієї Угоди. Таке повернення здійснюється Компанією виключно за зверненням Користувача, а грошові кошти повертаються на активний обліковий запис такого користувача з можливістю використання сплачених грошових коштів в майбутньому.            `, 
            ` • Грошові кошти, сплачені за розміщення оголошень про заборонені товари, послуги, пропозиції, при блокуванні облікового запису не повертаються.            `,
            `7.5. У разі систематичних (два і більше разів) порушень умов цієї Угоди повернення сплачених Користувачем грошових коштів відбувається на підставі рішення адміністрації Компанії після відповідного звернення Користувача. Адміністрація має право відмовити в поверненні коштів Користувачу, який систематично порушує умови Угоди.            `,
            `7.6. Користувач погоджується, що підтвердженням надання послуг зі сторони ТОВ "???????????" є Виписка з особового рахунку, якиа формується Виконавцем на підставі даних, доступних на акаунті Користувача. Виконавець надає Виписку з особового рахунку тільки за запитами Користувачів.            `,         
            `7.7. Компанія надає Акти прийому-передачі наданих послуг Бізнес-Користувачам, що є суб’єктами підприємницької діяльності, зареєстрованими у порядку, встановленому законодавством України, в електронній формі з використанням електронного цифрового підпису, виключно через сервіс електронного документообігу «Вчасно», що доступний в мережі Інтернет за адресою https://vchasno.com.ua            `,
            `7.8. Такий Користувач зобов'язується протягом 5 (п'яти) календарних днів після отримання Акту електронній формі підписати Акт з використанням електронного цифрового підпису і направити Компанії підписаний примірник Акту, або в той же термін направити Компанії мотивовану відмову від підписання Акту із зазначенням причин відмови від підписання. У разі якщо в зазначений термін Користувачем не буде відправлений підписаний Акт, або мотивовану відмову від його підписання, платні послуги, надані Компанією, вважаються прийнятими без зауважень щодо якості та строку надання.            `, 
            `7.9. Акти прийому-передачі наданих послуг надаються Бізнес-Користувачам, що є суб’єктами підприємницької діяльності тільки у випадку оплати послуг безпосередньо Компанії, без використання послуг платіжних провайдерів.            `,
        ]
    },
    {
        title: `ОБМЕЖЕННЯ ВІДПОВІДАЛЬНОСТІ`,
        subtitles: [
            `8.1. Скориставшись сервісами Сайтів, Користувач підтверджує свою згоду з тим, що він використовує Сайти і його сервіси на свій страх і ризик «як є», оцінює і несе всі ризики, пов'язані з використанням розміщених на Сайтах оголошень, а Компанія, в тому числі її керівництво , співробітники і агенти, не несуть ніякої відповідальності за зміст розміщених на Сайті оголошень, за будь-які збитки і втрати, які стали результатом використання розміщених на Сайтах оголошень - Користувача та інші дані.            `, 
            `8.2. Компанія не є організатором/ініціатором угоди між Користувачами, або її стороною. Сайт є торговою комунікаційною платформою, яка надає можливість Користувачам розміщувати для реалізації, продавати і купувати дозволені законодавством товари і послуги в будь-який час, звідки завгодно і за будь-якою ціною.            `,
            `8.3. Компанія не може контролювати достовірність інформації, яка розміщується користувачами в оголошеннях. Компанія не несе відповідальності за будь-які збитки, завдані в результаті вчинення правочину, або неналежної поведінки будь-якої зі сторін угоди.            `,
            `8.4. Компанія не несе відповідальності за поведінку Користувачів, або за пропоновані ними товари/послуги, зазначені в оголошеннях. Всі суперечки і конфлікти між Користувачами вирішуються ними самостійно без залучення Компанії.            `,
            `8.5. Компанія не несе відповідальності за будь-який несанкціонований доступ або використання серверів Компанії та/або будь-якої інформації про користувачів, що на них зберігається, а також за будь-які помилки, віруси, «троянські коні» і т.д., які можуть бути передані на Сайти або через Сайти третіми особами.            `,
            `8.6. Якість, безпека, законність і відповідність товару або послуги їх опису, а також можливість Користувача продати або придбати товар/послугу знаходяться поза контролем Компанії.            `,
            `8.7. Компанія закликає Користувачів бути обережними і зберігати здоровий глузд при користуванні послугами Сайтів. Користувач повинен прийняти до уваги, що його контрагент може не мати відповідної дієздатності, або видавати себе за іншу особу. Використання послуг Компанії має на увазі, що Користувач усвідомлює і приймає ці ризики, а також погоджується, що Компанія не несе відповідальності за дії або бездіяльність з боку Користувача.            `,
            `8.8. Користувач не може робити висновок, що пропозиція, продаж і придбання будь-якого товару або послуги є дійсними та легальними виходячи з факту розміщення, продажу та придбання товару або послуги на Сайтах. Компанія не несе відповідальності за завершення угоди Користувачем Сайтів. Користувач приймає на себе повну відповідальність за свої дії.            `,
            `8.9. Якщо у Користувача виникають претензії до іншого Користувача в результаті використання останнім послуг Сайту, Користувач погоджується пред'являти ці вимоги самостійно і без втручання з боку Компанії, а також звільняє Компанію (поряд з її дочірніми компаніями, афільованими особами, службовцями, директорами, уповноваженими і співробітниками) від всіх вимог, зобов'язань, компенсацій по відшкодуванню збитків, витрат (затрат), включаючи адвокатські гонорари, відомих або невідомих, що виникли в результаті, або у зв'язку з такими вимогами.            `,
            `8.10. Бездіяльність з боку Компанії в разі порушення Користувачем, або іншими Користувачами положень Угоди не позбавляє Компанію права здійснювати відповідні дії на захист своїх інтересів пізніше, а також не означає відмову Компанії від своїх прав, в разі здійснення подібних порушень в подальшому.            `,
            `8.11. Користувач має право повідомити Компанії про факт порушення його прав іншим Користувачем, скориставшись посиланням ???????????????. У разі обґрунтованості скарг Користувача, Компанія на свій розсуд видаляє оголошення, яке порушує права Користувача.            `,
            `8.12. Компанія не несе відповідальності за невиконання, або перешкоди у виконанні зобов'язань з надання доступу до Сайтів через обставини непереборної сили, наслідки яких не можна уникнути, або подолати (таких як рішення влади, трудові спори, нещасні випадки, розриви в загальній системі комунікацій і т. д.).            `,
            `8.13. Компанія не несе відповідальності за неполадки в роботі Сайтів, викликані технічними перебоями в роботі устаткування і програмного забезпечення.            `,
            `8.14. Ні за яких умов Компанія, її керівництво, співробітники та агенти, які не несуть відповідальності за прямі, непрямі збитки і виплачені штрафні санкції будь-якого характеру (навіть якщо Компанія була попереджена про можливість таких збитків) в результаті використання Сайтів і його сервісів Користувачем, включаючи без обмеження випадки, в яких збитки/шкода стала результатом використання або неправильного використання Сайтів і його сервісів.            `,
            `8.15. Ніщо в Угоді не може розумітися як встановлення між Користувачем та Компанією агентських відносин, відносин товариства, відносин по спільній діяльності, трудових відносин, або якихось інших відносин, прямо не передбачених Угодою.            `,
            `8.16. Компанія несе відповідальність за рекламу, розміщену на сервісах Сайтів, в межах, встановлених застосовним законодавством.            `,
            `8.17. Компанія не несе відповідальності за збереження інформації з акаунта, можливість використання сервісів Сайту, збереження та можливість використання коштів на особистому рахунку Користувача, у випадку блокування/заборони використання сторонніх сервісів, за допомогою яких Користувач здійснює реєстрацію, та/або вхід на Сайт, що знаходяться поза контролем Компанії.            `,
        ]
    },
    {
        title: `ТЕРМІН ДІЇ УГОДИ І ПРИПИНЕННЯ НАДАННЯ ПОСЛУГ САЙТУ`,
        subtitles: [
            `9.1. Ця Угода набуває чинності з моменту початку використання Користувачем будь-якого сервісу Сайту, встановлення мобільного додатку, або з моменту реєстрації Користувача на Сайті, і діє безстроково.            `,
            `9.2. Користувач має право припинити свою реєстрацію на Сайті в односторонньому порядку, без попереднього повідомлення про це Компанії і пояснення причин.            `,
            `9.3. У разі якщо Компанією були внесені будь-які зміни до Угоди в порядку, передбаченому пунктом 10.1. Угоди, з якими Користувач не згоден, він зобов'язаний припинити використання сервісів Сайтів. Факт продовження використання Сайтів є підтвердженням згоди Користувача з відповідною редакцією Угоди.            `,
            `9.4. Розірвання Угоди з боку Компанії може статися у випадках:            `,
            `9.5. Порушення положень цієї Угоди, нанесення будь-якої шкоди Компанії, в тому числі її репутації, або користувачам FIRM-UA.com;            `,
            `9.6. Інші дій, які суперечать політиці Компанії;            `,
            `9.7. Правові відносини можуть бути відновлені тільки після прийняття адміністрацією Компанії відповідного рішення.            `,
           
        ]
    },
    {
        title: `ВНЕСЕННЯ ЗМІН ДО УГОДИ`,
        subtitles: [
            `10.1. З метою покращення якості послуг, що надаються на Сайтах, та з метою дотримання вимог законодавства та реагування на зміну ринкових умов, ця Угода може бути змінена Компанією в односторонньому порядку. Нова редакція Угоди вступає в силу з моменту її розміщення в мережі Інтернет за вказаною в цьому абзаці Угоди адресою, якщо інше не передбачено новою редакцією Угоди. Чинна редакція Угоди завжди знаходиться на сторінці за адресою ?????????.            `,
            
        ]
    },
    {
        title: `ТЕРМІН ДІЇ УГОДИ І ПРИПИНЕННЯ НАДАННЯ ПОСЛУГ САЙТУ`,
        subtitles: [
            `11.1. Системні повідомлення Сайтів, що відносяться до оголошень Користувача, буде надіслано на електронну адресу, надану Користувачем при розміщенні оголошення на Сайтах, та / або у формі SMS-повідомлень, Viber-повідомлень на номер телефону, вказаний Користувачем. У разі небажання Користувача отримувати такі повідомлення Користувач має право видалити відповідні оголошення з Сайтів, або надіслати відповідне повідомлення в Службу підтримки Сайтів.            `,
            `11.2. Інформаційні повідомлення, призначені для широкого кола Користувачів, публікуються на Сайтах і/або посилаються на електронні адреси Користувачів, які підтвердили свою згоду на отримання таких повідомлень в процесі публікації оголошень/реєстрації на Сайтах.            `,
            `11.3. Користувачі мають право відмовитися від отримання інформаційних повідомлень на свою електронну адресу, та / або SMS-повідомлень, Viber-повідомлень на номер телефону, вказаний Користувачем, в будь-який момент через функцію «Відмовитися від розсилки», що міститься в обліковому записі Користувача. Значок «телефону» в обліковому записі Користувача дозволяє Користувачеві управляти розсилкою SMS-повідомлень, Viber-повідомлень і Push-повідомлень на телефон.            `,
            `11.4. При виникненні між Сторонами суперечок та розбіжностей за цією Угодою або у зв'язку з нею, Сторони зобов'язуються вирішувати їх шляхом переговорів. Якщо будь-які суперечки, розбіжності або вимоги, що виникають з приводу цієї Угоди або в зв'язку з нею, у тому числі, що стосуються її виконання, порушення, припинення, або недійсності, не можуть бути вирішені шляхом переговорів, то ці суперечки розглядаються відповідно до чинного законодавством в судовому порядку.            `,
            `11.5. Ця Угода регулюється і тлумачиться відповідно до законодавства України. Питання, не врегульовані цією Угодою, підлягають вирішенню відповідно до чинного законодавства України. Всі можливі суперечки, що випливають з відносин, що регулюються цією Угодою, вирішуються в порядку, встановленому законодавством України, за нормами права України.            `,
            `11.6. Скрізь по тексту цієї Угоди, якщо не зазначене інше, під термінами «чинне законодавство», «застосовне законодавство» розуміється як законодавство України, так і законодавство місця перебування Користувача/Користувачів.            `,
            `11.7. Визнання судом будь-якого положення Угоди недійсним або тим, що не підлягає примусовому виконанню не тягне за собою недійсності або невиконання інших положень цієї Угоди.             `,   
           ]
    },
]

const UserRules = () => {
    const { t } = useTranslation()
    return <Fragment>
        <CommonHeader className='menu_fix'/>
        <div className="confident_politics_wrapper" >
            <ol>
                {
                    text.map((item, index) => {
                        return <li key={index}> <h3>{index + 1}. {item.title}</h3>
                            <br />
                            <ul>
                                {item.subtitles.map((elem, i) => {
                                    return <li key={`a_${i}`}>{elem}</li>
                                })}
                            </ul>
                        </li>


                    })
                }
            </ol>
        </div>

    </Fragment >


}

export default UserRules;
